Revit 2027 API
RebarConstraint.IsToHostEdgeCover Method
 Checks if the RebarConstraintType of the RebarConstraint is 'ToHostEdgeCover'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsToHostEdgeCover()
Public Function IsToHostEdgeCover As Boolean
public:
bool IsToHostEdgeCover()
member IsToHostEdgeCover : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToHostEdgeCover', false otherwise.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace